/* ******************************************************************
 * Copyright (C) 2023 - AUDMBA
 *
 * This document is AUDMBA property.
 * It should not be reproduced in any medium or used in any way
 * without prior written consent of AUDMBA
 */
/*********************************************************************
 * @file        main.c
 * @brief       Initiate connection between a script python and the arduino.\n
 * @details     Programme permettant de faire clignoter la LED embarquée sur une carte Arduino Nano,
                à partir de commandes extérieures (via un script Python)

                --> la commande "START BLINK" permettra de démarrer le clignotement de la LED
                --> la commande "STOP BLINK" permettra l'arrêt de ce clignotement
 * @author      AUDMBA
 * @date        jj/mm/yyyy
 * @version     1.0
 */

// ********************************************************************
// *                      Includes
// ********************************************************************
#include <Arduino.h>
#include "Pyduino_Com.h"
// ********************************************************************
// *                      Defines
// ********************************************************************
#define ACT_LED 5
// ********************************************************************
// *                      Types
// ********************************************************************

// ********************************************************************
// *                      Constants
// ********************************************************************

// ********************************************************************
// *                      Variables
// ********************************************************************



//****************************************************************************
//                      Local functions - Prototypes
//****************************************************************************

//****************************************************************************
//                      Public functions - Implementation
//****************************************************************************

//****************************************************************************
//                      Local functions - Implementation
//****************************************************************************

// ********************************************************************
// *                       setup
// ********************************************************************
void setup() 
{
  
  pinMode(ACT_LED, OUTPUT);
  Serial.begin(9600);
}

// ********************************************************************
// *                       loop
// ********************************************************************
void loop() 
{
    Pyduino_Com MyComPyduino;
    MyComPyduino.ListenPythonForCommand();

}